# task4
# author: GL
# date: 21.07.19
# --------------------
# В течении дня в банк заходят люди, для каждого посещения фиксируется время захода в банк и  время выхода.
# Банк работает с 8:00 до 20:00.
# Написать программу, которая определяет периоды времени, когда в банке было максимальное количество посетителей.
# Файл содержит информацию о времени посещения банка каждым посетителем, округленном до минут.
# Время входа посетителя меньше либо равно времени выхода.
# Выведите интервалы времени, когда в банке было максимальное число посетителей.
# Начало и конец интервала разделяются пробелом.
# В случае необходимости вывести несколько периодов, в качестве разделителя между ними следует использовать символ перевода строки.
